-- Тестовые категории
INSERT INTO categories (name, color) VALUES 
('Работа', '#EF4444'),
('Личное', '#10B981'), 
('Идеи', '#8B5CF6');

-- Тестовые заметки
INSERT INTO notes (title, content, category_id, created_at, updated_at) VALUES
('Первая заметка', 'Это содержимое моей первой тестовой заметки.', (SELECT id FROM categories WHERE name = 'Личное'), '2024-01-15 10:00:00+00', '2024-01-15 10:00:00+00'),
('Список покупок', 'Молоко, Хлеб, Яйца, Фрукты, Овощи', (SELECT id FROM categories WHERE name = 'Личное'), '2024-01-14 15:30:00+00', '2024-01-14 16:45:00+00'),
('Задачи по проекту', '1. Разработать API\n2. Создать интерфейс\n3. Протестировать функционал', (SELECT id FROM categories WHERE name = 'Работа'), '2024-01-13 09:15:00+00', '2024-01-14 11:20:00+00'),
('Задачи по проекту 2', '1. Рефакторинг кода\n2. Написание тестов\n3. Деплой на прод', (SELECT id FROM categories WHERE name = 'Работа'), '2024-01-16 09:00:00+00', '2024-01-16 09:00:00+00'),
('Идеи для проектов', 'Телеграмм бот с нейросетью', (SELECT id FROM categories WHERE name = 'Идеи'), '2024-01-15 18:30:00+00', '2024-01-15 18:30:00+00');